# Арифметические операции
# +, -, *, /, %, //, **
# **, *, /, //, %, +, -
# (), сокращенные операции 

a = +123 # унарный плюс
b = -321
c = a + b
print(c)

a = 2
b = 8
c = a - b
print(c)

a = 2
b = 8
c = a * b
print(c)

a = 2
b = 8
c = a / b
print(c)

a = 12
b = 3
c = a // b  # // деление в целых числах
print(c)

a = 12
b = 8
c = a % b  # % остаток 4
print(c)

a = 2
b = 8
c = a ** b  # ** возведение в степень
print(c)

a = 2
b = 800
c = a ** b  # нет ограничения по хранению данных
print(c)

a = 1.3
b = 3
c = a * b
print(c)
# Получаем 3.9000000000000004, а не 3.9 - 
# это связано с хранением вещественных чисел
a = 1.3
b = 3
c = round(a * b) # округлит 4
print(c)

a = 1.3
b = 3
c = round(a * b, 3) # 3,9
print(c)

a = 1.31234
b = 3
c = round(a * b, 5) #
print(c)

a = 3
# a = a + 5
a += 5
print(a)

a = 3
# a = a * 5
a *= 5
print(a)
